title: Common Port with Unusual Service
id: 31c17136-c518-4fe1-b147-3304827364f6
status: stable
description: 'Identifies services using a NON ephemeral port for a service that normally should be using a source port greater than 1024. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: SOC Prime Team
tags:
  - attack.t1571
  - attack.command_and_control
logsource:
  product: zeek
  service: conn
detection:
  selection:
    src_port|lt: 1024
    service:
      - http
      - ssl
      - rdp
      - ssh
  from_internal:
    local_orig: 'true'
    local_resp: 'false'
  condition: selection and from_internal
level: low