title: Client Sending Large Amount of Data 
id: 32688a1a-c953-4afb-b96a-f366cf9782d1
description: 'Client is sending a large amount of data to another host. Verify if the destination is a known host for transfering files/data too. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: SOC Prime Team
logsource:
  product: zeek
  service: conn
tags:
  - attack.t1039
  - attack.collection 
detection:
  selection:
    request_body_len|lt: 1000000000 # 1GB
    response_body_len|gt: 100000000 # 100MB
  condition: selection
fields:
  - id.orig_h
  - id.orig_p
  - id.resp_h
  - id.resp_p
  - request_body_len
  - response_body_len
  - service
  - duration
  - orig_pkts
  - orig_ip_bytes
  - resp_pkts
  - resp_ip_bytes
falsepositive:
  - 'Backup servers such as for VMs, cloud file backups, etc.'
  - 'One time file sync/transfer that is non malicious'